<template>
  <div class="">

    <HeaderSection />
    <ProductsSection :products="products" />
    <QuestSection />
    <!-- <ServicesSection :services="services" /> -->
    <ContactSection />
    <AboutSection />
    <FooterSection />

  </div>

</template>

<script>
import HeaderSection from '@/components/sections/HeaderSection.vue'
import ProductsSection from '~/components/sections/ProductsSection.vue'
import QuestSection from '~/components/sections/QuestSection.vue'
// import ServicesSection from '@/components/sections/ServicesSection.vue'
import ContactSection from '~/components/sections/ContactSection.vue'
import AboutSection from '@/components/sections/AboutSection.vue'
import FooterSection from '@/components/sections/FooterSection.vue'

export default {
  name: 'IndexPage',
  components: {
    HeaderSection,
    ProductsSection,
    QuestSection,
    // ServicesSection,
    ContactSection,
    AboutSection,
    FooterSection,
  },
  scrollToTop: false,
  async asyncData({ $axios }) {
    const products = await [
      { "id": 1, "name": "Оборудование для стыковой сварки рельсов","description": null, "products": [{ "id": 1, "name": "Мобильная машина для стыковой сварки рельсов типа FBM-60" }, { "id": 1, "name": "Стационарная машина типа МСР-65.01 для стыковой сварки рельсов" }, { "id": 1, "name": "Мобильная машина для стыковой сварки рельсов типа FBM-140" }, { "id": 1, "name": "Стационарная машина типа МСО-120.01 для стыковой сварки рельсов" }]},
      { "id": 2, "name": "Комплексные решения","description": null, "products": [{ "id": 1, "name": "установка на ж/д платформу" }, { "id": 1, "name": "установка на базу грузового автомобиля" },]},
      { "id": 3, "name": "Испытательное оборудование","description": null, "products": [{ "id": 1, "name": "пресс Геркулес-300" },]},
      { "id": 4, "name": "Запасные части и комплектующие","description": "Мы предлагаем нашим клиентам высококачественные запасные части для широкого спектра железнодорожной строительной техники. Детали разрабатываются и изготавливаются по запросу с учетом особенностей каждой машины.", "products": [{ "id": 1, "name": "Трансформаторы" }, { "id": 2, "name": "ТК-355 для рельсосварочной машины" }, { "id": 3, "name": "ТК-1000 для рельсосварочной машины" }, { "id": 4, "name": "Губки и электроды" }, { "id": 5, "name": "Гратосъемные ножи" }, { "id": 6, "name": "Шины и токопроводы" }]},
    ]
    const services = await [
      { "id": 1, "name": "Обучение и техническая поддержка","text": "Мы предлагаем специализированное техническое обучение и консультации по электросварке рельсов. Наша команда состоит из опытных инженеров и квалифицированных рабочих, которые всегда готовы и рады поделиться своими знаниями с другими профессионалами в этой области.<br /><br />Сервисная служба компании Railwelding уделяет много внимания качественной передаче знаний, постоянному сопровождению и обеспечению устойчивого производства без необходимости частого технического обслуживания. Такой комплексный подход к клиентскому сервису является залогом долгосрочного плодотворного сотрудничества.<br /><br />Мы охотно обучим и проконсультируем вас по всем вопросам эксплуатации и обслуживания выпускаемого нами оборудования.", },
      { "id": 2, "name": "Обслуживание и устранение неполадок на месте","text": "Мы предлагаем сервисное обслуживание и устранение неполадок на месте для всего ассортимента продуктов и оборудования Railwelding.<br /><br />Наши специалисты готовы оперативно вмешаться, чтобы работы можно было возобновить как можно скорее.", },
      { "id": 3, "name": "Капитальный ремонт оборудования","text": "Профессиональное и регулярное техническое обслуживание оборудования минимизирует внеплановые и дорогостоящие простои и обеспечивает необходимую производительность. Благодаря этому, также снижаются до необходимого минимума расходы на ремонт.<br /><br />Сервисные специалисты Railwelding имеют многолетний опыт разработки и ремонта рельсосварочных машин и комплектующего оборудования и регулярно осуществляют гарантийное и пост гарантийное обслуживание производимого оборудования в соответствии с действующими стандартами.<br /><br />Однако, если у вас возникнет необходимость в ремонте или модернизации (переоснащении) устаревшего или вышедшего из строя рельсосварочного оборудования, мы окажем вам быструю и надёжную помощь в этом.<br /><br />Благодаря наличию необходимого собственного оборудования, инструментов и комплектующих деталей, ваше оборудование быстро вернётся в строй.<br /><br />Мы готовы не только осуществить полное восстановление бывшего в эксплуатации оборудования, но и улучшить его технические характеристики, необходимые для введения вашей устаревшей рельсосварочной машины в современное производство.<br /><br />Мы дадим вашему оборудованию новую жизнь!", },
    ]
    // const products = await $axios.$get('c/products/')
    // const about = await $axios.$get('con/about/')


    return { products, services }
  },
  // created () {
  //   window.addEventListener('scroll', this.onScroll);
  // },
  // destroyed () {
  //   window.removeEventListener('scroll', this.onScroll);
  // },
}
</script>
